
import 'package:DairyDunk/model/Product.dart';

List<Product> productMenu = [
  Product(
      name: "นมสดรสจืด",
      description:
          "    เมจิ น้ำนมโคแท้ 100% ขนาด200ml รสชาติอร่อย เข้มข้น หอมมันและอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์มากมายจากธรรมชาติ ",
      price: 13.00,
      imagepath: "lib/images/milk/plainmilk.png",

      catagory: ProductCatagory.Milk),
  Product(
      name: "นมสดกลิ่นเมล่อนญี่ปุ่น",
      description:
          "    นมเมจิกลิ่นเมล่อนญี่ปุ่น ขนาด200ml กับรสชาติความอร่อยแบบต้นตำรับสไตล์ญี่ปุ่น หอมอร่อยชื่นใจ ได้ประโยชน์จากนมแบบเน้นๆ!",
      price: 13.00,
      imagepath: "lib/images/milk/melonmilk.png",
      catagory: ProductCatagory.Milk),
  // yogurt
  Product(
      name: "นมพาสเจอร์ไรส์รสกาแฟ",
      description:
          "    เมจิ นมพาสเจอร์ไรส์รสกาแฟอร่อย เข้มข้น เต็มรสกาแฟแท้ๆ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์ต่อร่างกาย อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2",
      price: 13.00,
      imagepath: "lib/images/milk/coffee.png",
      catagory: ProductCatagory.Milk),
  Product(
      name: "นมรสช็อกโกแลตมอลต์",
      description:
          "    เมจิ นมพาสเจอร์ไรส์รสช็อกโกแลตมอลต์ผสานความอร่อยจาก 2 คุณค่าของนมช็อกโกแลต กับมอลต์สกัดเข้มข้น ให้รสชาติอร่อยลงตัวของนมรสช็อกโกแลตมอล์ตแบบเฉพาะของเมจิ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์ต่อร่างกาย อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2 ",
      price: 13.00,
      imagepath: "lib/images/milk/malt.png",
      catagory: ProductCatagory.Milk),
  Product(
      name: "นมรสช็อกโกแลต",
      description:
          "    เมจิ นมพาสเจอร์ไรส์รสช็อกโกแลตอร่อยเข้มข้นด้วยรสช็อกโกแลตแท้แบบเต็มๆ ที่สุดของนมช็อกโกแลต สูตรเฉพาะของเมจิ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์ต่อร่างกาย อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2",
      price: 13.00,
      imagepath: "lib/images/milk/cocoa.png",
      catagory: ProductCatagory.Milk),
   Product(
      name: "นมกลิ่นสตรอเบอร์รี",
      description:
          "    เมจิ นมพาสเจอร์ไรส์กลิ่นสตรอเบอร์รีหอมอร่อย กลมกล่อม ด้วยกลิ่นสตรอเบอร์รีแบบไขมันต่ำ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์ต่อร่างกาย อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2    ",
      price: 13.00,
      imagepath: "lib/images/milk/strawberry.png",
      catagory: ProductCatagory.Milk),
    Product(
      name: "น้ำนมโคแท้ 100% สูตรไขมัน 0%",
      description:
          "    เมจิ น้ำนมโคแท้ 100% สูตรไขมัน 0% ผลิตจากน้ำนมโคแท้ขาดมันเนย 100% อร่อย ไร้กังวลเรื่องไขมัน ดีต่อสุขภาพ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์มากมายจากธรรมชาติ อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2 มั่นใจคุณภาพด้วยแบรนด์ยอดขายอันดับ 1 ตลาดนมพาสเจอร์ไรส์",
      price: 13.00,
      imagepath: "lib/images/milk/zerofat.png",
      catagory: ProductCatagory.Milk),
    Product(
      name: "นมรสจืดขนาด 2 ลิตร",
      description:
          "    เมจิ น้ำนมโคแท้ 100%ผลิตจากน้ำนมโคแท้คุณภาพเยี่ยม 100% รสชาติอร่อย เข้มข้น หอมมัน และอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์มากมายจากธรรมชาติ อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2 มั่นใจคุณภาพด้วยแบรนด์ยอดขายอันดับ 1 ตลาดนมพาสเจอร์ไรส์",
      price: 100.00,
      imagepath: "lib/images/milk/2kblue.png",
      catagory: ProductCatagory.B2B),
    Product(
      name: "นมรสจืดไขมัน 0%ขนาด 2 ลิตร",
      description:
          "    เมจิ น้ำนมโคแท้ 100% สูตรไขมัน 0%ผลิตจากน้ำนมโคแท้ขาดมันเนย 100% อร่อย ไร้กังวลเรื่องไขมัน ดีต่อสุขภาพ พร้อมอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์มากมายจากธรรมชาติ อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2 มั่นใจคุณภาพด้วยแบรนด์ยอดขายอันดับ 1 ตลาดนมพาสเจอร์ไรส์ ",
      price: 100.00,
      imagepath: "lib/images/milk/2kzerofat.png",
      catagory: ProductCatagory.B2B),
    Product(
      name: "เรย์ นมพาสเจอร์ไรส์ขนาด 2 ลิตร",
      description:
          "    เมจิ เรย์ นมคุณภาพที่ช่วยเสริมรสชาติของกาแฟคุณภาพ นมโคแท้ 100% ผลิตจากน้ำนมโคแท้คุณภาพเยี่ยม เนื้อนมเข้มข้น หอม หวาน มัน ไม่กลบรสชาติของกาแฟ เสริมรสชาติเฉพาะตัวของกาแฟทุกสายพันธุ์",
      price: 100.00,
      imagepath: "lib/images/milk/ray.png",
      catagory: ProductCatagory.B2B),
    Product(
      name: "นมรสจืดขนาด 5 ลิตร",
      description:
          "    เมจิ น้ำนมโคแท้ 100%ผลิตจากน้ำนมโคแท้คุณภาพเยี่ยม 100% รสชาติอร่อย เข้มข้น หอมมันและอุดมไปด้วยคุณค่าสารอาหารที่มีประโยชน์มากมายจากธรรมชาติ อาทิเช่น โปรตีน, แคลเซียม, และวิตามินบี 2 มั่นใจคุณภาพด้วยแบรนด์ยอดขายอันดับ 1 ตลาดนมพาสเจอร์ไรส์ ",
      price: 225.00,
      imagepath: "lib/images/milk/5kblue.png",
      catagory: ProductCatagory.B2B),
    Product(
      name: "นมเปรี้ยว กลิ่นบลูเบอร์รี",
      description:
          "    นมเปรี้ยวพร้อมดื่มเมจิ ไพเกน กลิ่นบลูเบอร์รีอร่อยสดชื่นด้วยกลิ่นบลูเบอร์รี พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 7.00,
      imagepath: "lib/images/yogurt/blueyd.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "นมเปรี้ยว กลิ่นผลไม้รวม",
      description:
          "นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นผลไม้รวมอร่อยสดชื่นด้วยกลิ่นผลไม้รวม พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 7.00,
      imagepath: "lib/images/yogurt/mixfruit80.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "นมเปรี้ยว กลิ่นสตรอเบอร์รี",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นสตรอเบอร์รีอร่อยสดชื่นด้วยกลิ่นสตรอเบอร์รี พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 7.00,
      imagepath: "lib/images/yogurt/strawberry80.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "นมเปรี้ยว กลิ่นส้ม",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นส้มอร่อยสดชื่นด้วยกลิ่นส้ม พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 7.00,
      imagepath: "lib/images/yogurt/orange80.png",
      catagory: ProductCatagory.Yogurt),
     Product(
      name: "นมเปรี้ยว รสธรรมชาติ",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน รสธรรมชาติเปรี้ยวหวาน อร่อยสดชื่น พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 7.00,
      imagepath: "lib/images/yogurt/origin80.png",
      catagory: ProductCatagory.Yogurt),
      Product(
      name: "นมเปรี้ยว รสธรรมชาติ 155 มล.",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน รสธรรมชาติเปรี้ยวหวาน อร่อยสดชื่น พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 10.00,
      imagepath: "lib/images/yogurt/origin155.png",
      catagory: ProductCatagory.Yogurt),
      Product(
      name: "นมเปรี้ยว กลิ่นบลูเบอร์รี 155 มล.",
      description:
          "    นมเปรี้ยวพร้อมดื่มเมจิ ไพเกน กลิ่นบลูเบอร์รีอร่อยสดชื่นด้วยกลิ่นบลูเบอร์รี พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 10.00,
      imagepath: "lib/images/yogurt/blueberry155.png",
      catagory: ProductCatagory.Yogurt),
      Product(
      name: "นมเปรี้ยว กลิ่นผลไม้รวม 155 มล.",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นผลไม้รวมอร่อยสดชื่นด้วยกลิ่นผลไม้รวม พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 10.00,
      imagepath: "lib/images/yogurt/mixfruit155.png",
      catagory: ProductCatagory.Yogurt),
      Product(
      name: "นมเปรี้ยว กลิ่นสตรอเบอร์รี 155 มล.",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นสตรอเบอร์รีอร่อยสดชื่นด้วยกลิ่นสตรอเบอร์รี พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 10.00,
      imagepath: "lib/images/yogurt/strawberry155.png",
      catagory: ProductCatagory.Yogurt),
      Product(
      name: "นมเปรี้ยว กลิ่นส้ม 155 มล.",
      description:
          "    นมเปรี้ยวโยเกิร์ตพร้อมดื่มเมจิ ไพเกน กลิ่นส้มอร่อยสดชื่นด้วยกลิ่นส้ม พร้อมประโยชน์ดีๆจากจุลินทรีย์มีชีวิต ปราศจากไขมัน ให้ความอร่อยสดชื่นพร้อมดูแลคุณได้ทุกวัน",
      price: 10.00,
      imagepath: "lib/images/yogurt/orange155.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ตรสพีชผสมวุ้นมะพร้าว",
      description:
          "    โยเกิร์ตเมจิ รสพีชผสมวุ้นมะพร้าว หลงรักความพีชที่ละมุนเกินห้ามใจ กับโยเกิร์ตเมจิเนื้อนุ่มๆ ",
      price: 15.00,
      imagepath: "lib/images/yogurt/peachyogurt.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ตรสมิกซ์เบอร์รี",
      description:
          "    โยเกิร์ตเมจิ รสรสมิกซ์เบอร์รี อร่อยเนื้อนุ่ม.ฟินกับผลไม้ ด้วยโยเกิร์ตเนื้อนุ่มสูตรใหม่แบบเฉพาะของเมจิ ",
      price: 15.00,
      imagepath: "lib/images/yogurt/mixedberryyogurt.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ตรสองุ่นผสมวุ้นมะพร้าว",
      description:
          "    โยเกิร์ตเมจิ รสองุ่นผสมวุ้นมะพร้าว อร่อยเนื้อนุ่ม...วุ้นแน่น ด้วยโยเกิร์ตเนื้อนุ่มสูตรใหม่แบบเฉพาะของเมจิ หอมอร่อยกับรสองุ่นจากน้ำองุ่นสกัดเข้มข้น และชิ้นวุ้นมะพร้าวแน่นๆ ที่เพิ่มขึ้นอีก 10% ให้คุณอร่อยเคี้ยวเพลินได้ทุกคำ พร้อมประโยชน์ดีๆ จากจุลินทรีย์โพรไบโอติก ",
      price: 15.00,
      imagepath: "lib/images/yogurt/grapeyg.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ตเมจิ รสออริจินัล",
      description:
          "    โยเกิร์ตเมจิ รสออริจินัล อร่อยเนื้อนุ่ม...จากนมคุณภาพ ด้วยโยเกิร์ตเนื้อนุ่มสูตรใหม่ แบบเฉพาะของเมจิ ที่ผลิตจากนมโคคุณภาพเยี่ยม พร้อมประโยชน์ดีๆ จากจุลินทรีย์โพรไบโอติก",
      price: 15.00,
      imagepath: "lib/images/yogurt/originyg.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ตเมจิ วุ้นมะพร้าว",
      description:
          "    โยเกิร์ตเมจิ รสวุ้นมะพร้าว อร่อยเนื้อนุ่ม...ฟินกับผลไม้ ด้วยโยเกิร์ตเนื้อนุ่มสูตรใหม่ แบบเฉพาะของเมจิ และชิ้นวุ้นมะพร้าวที่กระจายทั่วเนื้อโยเกิร์ต ให้คุณอร่อยได้ทุกคำ พร้อมประโยชน์ดีๆ จากจุลินทรีย์โพรไบโอติก",
      price: 15.00,
      imagepath: "lib/images/yogurt/coconutyg.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "โยเกิร์ต สตรอเบอร์รี",
      description:
          "    โยเกิร์ตเมจิ รสสตรอเบอร์รี อร่อยเนื้อนุ่ม...ฟินกับผลไม้ ด้วยโยเกิร์ตเนื้อนุ่มสูตรใหม่แบบเฉพาะของเมจิ และชิ้นสตรอเบอร์รีที่กระจายทั่วเนื้อโยเกิร์ต ให้คุณอร่อยได้ทุกคำพร้อมประโยชน์ดีๆ จากจุลินทรีย์โพรไบโอติก",
      price: 15.00,
      imagepath: "lib/images/yogurt/strawberryyg.png",
      catagory: ProductCatagory.Yogurt),
    Product(
      name: "น้ำนมข้าว",
      description:
          "    น้ำนมข้าวทดสอบ",
      price: 5.50,
      imagepath: "lib/images/milk/ricemilk.png",
      catagory: ProductCatagory.Milk),
];
